<template>
    <BaseModal :isOpen="isOpen" :closeModal="closeModal">
        <div class="services-list">
            <ServiceCard v-for="(service, index) in services" :key="service.id" :title="service.title"
                :description="service.description" :items="service.items" :isEven="index % 2 === 0" />
        </div>
    </BaseModal>
</template>

<script setup>
import { defineProps } from 'vue';

import BaseModal from '@/components/modals/base/BaseModal.vue';
import ServiceCard from '@/components/ServiceCard.vue';

const props = defineProps({
    isOpen: {
        type: Boolean,
        required: true,
    },
    closeModal: {
        type: Function,
        required: true,
    },
    tenderServiceData: {
        type: Array,
        required: true,
    },
});


const services = [
    {
        id: 1,
        title: 'Правовая консультация',
        description: '',
        items: [
            'Правовая консультация до возбуждения уголовного дела. Помощь в составлении заявления о возбуждении уголовного дела, участие при опросе пострадавшего должностными лицами, обжалование бездействий или решения об отказе в возбуждении уголовного дела.'
        ]
    },
    {
        id: 2,
        title: 'Защита подозреваемого',
        description: '',
        items: [
            'Защита подозреваемого или обвиняемого на этапе предварительного расследования. Ознакомление с материалами дела, определение судебной перспективы, выработка тактики защиты, участие в допросах, очных ставках, обысках, выемках и других следственных действиях.'
        ]
    },
    {
        id: 3,
        title: 'Представление интересов',
        description: '',
        items: [
            'Представление интересов потерпевшего, гражданского истца, гражданского ответчика, а также свидетеля в ходе предварительного расследования. Ознакомление с материалами дела, консультирование по вопросам привлечения к уголовной ответственности, возмещения материального и морального вреда, участие в следственных действиях, составление гражданского иска и возражений на него, обжалование действий и решений следователя, прокурора, судьи.'
        ]
    },
    {
        id: 4,
        title: 'Участие в суде первой инстанции',
        description: '',
        items: [
            'Участие адвоката при рассмотрении уголовного дела в суде первой инстанции. Защита прав подсудимого: выработка линии и тактики защиты, консультирование подзащитного и его родственников, формирование позиции защиты, участие в судебных заседаниях, ведение аудиозаписи судебных заседаний.'
        ]
    },
    {
        id: 5,
        title: 'Участие в кассационной инстанции',
        description: '',
        items: [
            'Участие адвоката в суде кассационной (апелляционной) инстанции. Изучение материалов уголовного дела, выработка линии и тактики защиты, оценка перспективы обжалования приговора, составление и подача кассационной (апелляционной) жалобы на приговор, вынесенный судом первой инстанции, посещение осужденного в СИЗО, консультирование его и близких родственников, участие при рассмотрении жалобы судом кассационной (апелляционной) инстанции.'
        ]
    },
    {
        id: 6,
        title: 'Исполнение приговора',
        description: '',
        items: [
            'Участие адвоката на стадии исполнения приговора. Защита прав осужденного: определение места отбывания наказания, условно-досрочное освобождение от отбывания наказания, замена неотбытой части наказания более мягким видом наказания, досрочное погашение судимости, снятие судимости, обжалование действий и решений администрации колонии или иного органа, ведающего исполнением наказания.'
        ]
    }
];
</script>

<style scoped>
.services-list {
  display: flex;
  flex-direction: column;
  align-items: flex-start; 
}
</style>
