<template>
    <BaseModal :isOpen="isOpen" :closeModal="closeModal">
      <div class="services-list">
        <ServiceCard
          v-for="(service, index) in services"
          :key="service.id"
          :title="service.title"
          :description="service.description"
          :items="service.items"
          :isEven="index % 2 === 0"
        />
      </div>
    </BaseModal>
  </template>
  
  <script setup>
import { ref } from 'vue';

import BaseModal from '@/components/modals/base/BaseModal.vue';
import ServiceCard from '@/components/ServiceCard.vue';

const props = defineProps({
    // services: {
    //   type: Array,
    //   required: true,
    // },
    isOpen: {
      type: Boolean,
      required: true,
    },
    closeModal: {
      type: Function,
      required: true,
    },
  });
  

  const services = ref([
    {
        id: 1,
        title: 'Услуги по сопровождению налоговых проверок',
        description: 'Полное сопровождение налоговых проверок «под ключ»',
        items: [
            'Представительство в комиссиях (по НДС и проч.)',
            'Представительство при проведении камеральных (выездных) проверок',
            'Аудит налогового учёта',
            'Анализ налоговых рисков и совершенных сделок',
            'Консультирование по бухгалтерскому учёту и налогам',
            'Консультирование по налоговым спорам',
            'Анализ контрагентов',
            'Аналог выездной налоговой проверки',
            'Снижение налоговых рисков',
        ],
    },
    {
        id: 2,
        title: 'Услуги по сопровождению налоговых проверок',
        description: 'Отсутствие сопровождения налоговых проверок профессионалами очень часто влечет неоправданные расходы.',
        items: [
            'Наши налоговые консультанты окажут помощь как до начала налоговой проверки, так и на этапе ее проведения.',
            'Если государственный орган уже принял ненормативно-правовой акт по результатам окончания налоговой проверки с необоснованными, на Ваш взгляд, доначислениями, то мы обжалуем их (в досудебном порядке или через суд).',
        ],
    },
    {
        id: 3,
        title: 'Услуга сопровождения налоговых проверок',
        description: 'Обеспечивает:',
        items: [
            'Минимизацию сумм доначисленных налогов, штрафов и пеней',
            'Недопущение некорректных вопросов со стороны инспекторов на допросах в налоговых органах',
            'Отстаивание интересов в досудебном порядке — спор доводится до арбитражного Суда в исключительных случаях',
        ],
    },
    {
        id: 4,
        title: 'Аудит налогового учёта',
        description: 'Проведение налогового аудита.',
        items: [
            'Восстановление бухгалтерского и налогового учета.',
            'Разработка методических рекомендаций по ведению учета.',
            'Анализируя текущую систему учета, мы разрабатываем рекомендации по исправлению ключевых недочетов и стратегию оптимизации.',
        ],
    },
    {
        id: 5,
        title: 'Консультирование по налоговым спорам',
        description: 'Наши эксперты окажут квалифицированную юридическую поддержку на любом этапе спора.',
        items: [
            'Досудебное урегулирование споров.',
            'Представление интересов в налоговых органах.',
            'Консультирование по арбитражным разбирательствам.',
            'Подготовка исков и процессуальных документов.',
            'Представление интересов в суде и на стадии исполнительного производства.',
        ],
    },
    {
        id: 6,
        title: 'Анализ налоговых рисков и совершенных сделок',
        description: 'Анализ деятельности компании и прогнозирование налоговых рисков.',
        items: [
            'Консультирование по актуальным изменениям в налоговом законодательстве и судебной практике.',
            'Содействие в оптимизации налоговой политики.',
            'Организация документооборота и контроль исполнения налоговых обязательств.',
            'Оценка возможностей применения налоговых льгот и информирование о правилах их использования.',
        ],
    },
    {
        id: 7,
        title: 'Консультирование по бухгалтерскому учёту и налогам',
        description: 'Устные или письменные консультации по конкретным вопросам.',
        items: [
            'Подготовка информации обо всех изменениях в законодательстве и анализ их влияния на деятельность компании.',
            'Разработка рекомендаций по отражению операций в учете.',
            'Ознакомление с позицией фискальных органов и судебной практикой по интересующим вопросам.',
            'Анализ документов и сделок с точки зрения налоговых рисков и разработка рекомендаций по их снижению.',
            'Помощь в оформлении налоговых деклараций и расчетов.',
            'Сопровождение бизнеса в налоговых спорах.',
        ],
    },
]);

</script>

<style scoped>
.services-list {
  display: flex;
  flex-direction: column;
  align-items: flex-start; /* Выравнивание по левому краю */
}
</style>