<template>
    <BaseModal :isOpen="isOpen" :closeModal="closeModal">
        <div class="services-list">
            <ServiceCard v-for="(service, index) in services" :key="service.id" :title="service.title"
                :description="service.description" :items="service.items" :isEven="index % 2 === 0" />
        </div>
    </BaseModal>
</template>

<script setup>
import { defineProps } from 'vue';

import BaseModal from '@/components/modals/base/BaseModal.vue';
import ServiceCard from '@/components/ServiceCard.vue';

const props = defineProps({
    isOpen: {
        type: Boolean,
        required: true,
    },
    closeModal: {
        type: Function,
        required: true,
    },
    tenderServiceData: {
        type: Array,
        required: true,
    },
});


const services = [
    {
        id: 1,
        title: 'Юридическое сопровождение бизнес-проектов',
        description: '',
        items: [
            'Сопровождение сделок, процедур и проектов.',
            'Досудебное урегулирование споров.',
            'Правовой аудит (полная проверка деятельности, оценка рисков).',
            'Представление интересов во взаимоотношениях с государственными органами.',
            'Непрерывная консультационная работа.',
            'Составление (разработка) договоров.',
            'Участие в судебных заседаниях во всех инстанциях.',
            'Работа с «проблемными» клиентами.',
            'Разрешение споров с работниками.',
            'Взыскание долгов.',
            'Участие в переговорах.',
            'Защита интеллектуальной собственности.',
            'Подготовка внутренних документов.',
            'Автоматизация юридических процессов (дистанционное заключение договоров на сайте и др.).',
            'Сопровождение деятельности онлайн магазинов, школ и др.',
            'Работа с маркетплейсами:',
            'Обжалование штрафов, выставленных торговыми площадками',
            'Составление жалоб и претензий на действие/бездействие маркетплейса',
            'Судебная защита прав продавца',
            'Оспаривание штрафов за самовыкупы',
            'Защита прав покупателей'
        ]
    },
    {
        id: 2,
        title: 'Юридические услуги в сфере недвижимости',
        description: '',
        items: [
            'Тщательная проверка юридической истории объекта (самая полная проверка объекта и продавца)',
            'Выявление мошенников и мошеннических схем при продаже недвижимости',
            'Оценка юридических рисков при покупке недвижимости',
            'Помощь с оформлением документов',
            'Составление договоров купли-продажи, аренды, мены, дарения и др.',
            'Разрешение споров в суде',
            'Оспаривание права собственности',
            'Признание сделок с недвижимостью недействительными',
            'Признание права собственности',
            'Защита прав добросовестного приобретателя',
            'Выделение доли, продажа и покупка долей в объекте недвижимости',
            'Снятие обременений (ареста, запрета на регистрационные действия и др.)',
            'Помощь в продаже объектов, купленных за счет средств материнского капитала',
            'Помощь в приемке объектов от застройщика',
            'Споры с застройщиками',
            'Взыскание неустойки по договору долевого участия в строительстве',
            'Споры с ТСЖ и управляющими компаниями',
            'Взыскание ущерба при затоплении квартиры',
            'Компенсация за некачественный ремонт',
            'Иные вопросы в сфере недвижимости'
        ]
    },
    {
        id: 3,
        title: 'Сопутствующие услуги',
        description: '',
        items: [
            'Поможем выгодно и быстро продать дом, квартиру, земельный участок.',
            'Работаем «под ключ»: фото-, видеосъемка, размещение объявлений, их продвижение, поиск покупателей, показы объекта, ведение переговоров и т.п.',
            'Изучим документы на объект, найдем сильные и выгодные позиции, сформируем оптимальное предложение для продажи.',
            'Переоформим уступку права по ДДУ'
        ]
    },
    {
        id: 4,
        title: 'Защита прав автовладельцев',
        description: '',
        items: [
            'Споры со страховыми компаниями;',
            'Взыскание ущерба при ДТП;',
            'Компенсация морального вреда;',
            'Возмещение вреда здоровью;',
            'Оценка / оспаривание стоимости ремонта;',
            'Помощь при оформлении купли-продажи авто;',
            'Возврат / ремонт некачественного автомобиля;',
            'Снятие ареста;',
            'Проверка авто и продавца;',
            'Иные автотранспортные дела.',
            'Поможем оформить куплю-продажу, аренду, дарение авто',
            'Некачественный ремонт авто: возместим убытки',
            'Вернем переплату за допуслуги при покупке авто в салоне',
            'Взыщем ущерб с виновника ДТП',
            'Ведем споры со страховой компанией',
            'Вернем деньги за некачественный автомобиль',
            'Обеспечим защиту прав автовладельца',
            'Упало дерево, попали в люк, наехали на яму: возместим стоимость ремонта авто'
        ]
    },
    {
        id: 5,
        title: 'Семейные дела',
        description: '',
        items: [
            'Расторжение брака;',
            'Раздел совместно нажитого имущества;',
            'Взыскание алиментов;',
            'Развод "под ключ";',
            'Оспаривание отцовства;',
            'Определение порядка общения с ребенком;',
            'Брачный контракт: заключение, оспаривание;',
            'Определение места жительства ребенка;',
            'Иные семейные дела.',
            'Минимизируем негативные эмоции;',
            'Увеличим / уменьшим размер алиментов;',
            'Разделим совместный бизнес;',
            'Сохраним личное имущество;',
            'Поможем заключить мировое соглашение;',
            'Подготовим и получим все необходимые документы'
        ]
    }
];
</script>

<style scoped>
.services-list {
  display: flex;
  flex-direction: column;
  align-items: flex-start; 
}
</style>
