<template>
    <BaseModal :isOpen="isOpen" :closeModal="closeModal">
        <div class="services-list">
            <ServiceCard v-for="(service, index) in services" :key="service.id" :title="service.title"
                :description="service.description" :items="service.items" :isEven="index % 2 === 0" />
        </div>
    </BaseModal>
</template>

<script setup>
import { defineProps } from 'vue';

import BaseModal from '@/components/modals/base/BaseModal.vue';
import ServiceCard from '@/components/ServiceCard.vue';

const props = defineProps({
    isOpen: {
        type: Boolean,
        required: true,
    },
    closeModal: {
        type: Function,
        required: true,
    },
    tenderServiceData: {
        type: Array,
        required: true,
    },
});

// src/components/Modals/ServicesModal.vue
const services = [
    {
        id: 1,
        title: 'Команда PROFIT-Group',
        description: 'Готова стать полноценным тендерным отделом или контрактной службой для Вашей компании. За более чем <b>8</b>-летнюю практику мы постоянно помогаем нашим клиентам в России успешно заключать контракты на электронных площадках.',
        items: [
            'Тендерное сопровождение от PROFIT-Group - это гарантия допуска к каждой закупке, автоматический и ручной поиск тендеров по всей России, а также услуги персонального менеджера.',
            'Благодаря многолетнему опыту, глубокому знанию рынка, разумной ценовой политике и работе с крупнейшими банками мы предлагаем наиболее эффективные решения для развития Вашего бизнеса.'
        ]
    },
    {
        id: 2,
        title: '<b>8</b>+ лет на рынке услуг для бизнеса в сфере сопровождения торгов',
        description: '',
        items: [
            '<b>100%</b> необоснованно отклоненных заявок успешно обжалуются в ФАС',
            'На <b>100%</b> квалифицированная команда лучших специалистов',
            'Работа со всеми банками по направлению банковских гарантий и займов'
        ]
    },
    // {
    //     id: 3,
    //     title: 'Получить консультацию',
    //     description: 'Данные',
    //     items: []
    // },
    {
        id: 4,
        title: 'Услуги',
        description: '',
        items: [
            'Срочная подача заявки на участие: Мы подключимся, даже если до окончания приема заявок осталось <b>2</b> часа',
            'Участие в электронных торгах за вас: Подадим заявку, примем участие в аукционе, отследим все протоколы и поможем в заключении контракта с заказчиком',
            'Используем более <b>900</b> площадок: Все государственные и коммерческие площадки',
            'Банковская гарантия со ставкой от <b>1,76%</b>: Работаем со всеми банками, выдача банковской гарантии за час',
            'Рассрочка на банковские гарантии без переплаты: Поможем оформить оплату банковской комиссии по частям',
            'Предоставление кредитной линии на выполнение выигранных тендеров: Помощь и поддержка в оформлении кредитной линии'
        ]
    },
    {
        id: 5,
        title: 'Преимущества работы с нами',
        description: '',
        items: [
            'Экономия времени:',
            'автоматический и ручной поиск тендеров',
            'участие во всех этапах закупки',
            'сопровождение исполнения контракта',
            'Надежность и уверенность:',
            'опыт более <b>8</b> лет',
            'отсутствие перерывов в работе на отпуск, больничный, смену специалиста',
            'подача жалоб и апелляций в ФАС',
            'Лучшие условия сотрудничества:',
            'индивидуальный подход к каждому клиенту',
            'гибкая система оплаты',
            'персональный менеджер',
            'Финансовое сопровождение:',
            'анализ и рекомендации по финансовой документации',
            'оперативное обеспечение получения любых форм обеспечения',
            'лучшие предложения – выгоднее чем напрямую в банке'
        ]
    },
    {
        id: 6,
        title: 'Этапы работы',
        description: '',
        items: [
            'анализ компании - Проверка возможности участия в тендере, анализ вашей отрасли для выявления общего количества закупок и конкуренции.',
            'поиск подходящих тендеров - Мониторинг торгов, наиболее подходящих для вашей компании.',
            'подготовка документов на тендер - Сбор пакета документов и обеспечение необходимых условий для подачи заявки.',
            'участие в торгах - Непосредственное участие в аукционах, переторжках, окончательных предложениях.',
            'заключение контракта - Отслеживание направления проекта контракта и его подписание электронной подписью.',
            'консультация на время исполнения контракта - Консультация по любым вопросам, возникающим в рамках исполнения контракта с заказчиком.'
        ]
    },
    {
        id: 7,
        title: 'Тарифы',
        description: '',
        items: [
            '44-ФЗ от <b>12 000</b> ₽ в мес. + % / от <b>100 000</b> ₽ в год + %',
            'ОСНОВНЫЕ УСЛУГИ:',
            '• Подготовим и подадим заявки по 44-ФЗ без ограничения по количеству',
            '• Подготовим и подадим жалобы, представим ваши интересы в ФАС',
            '• Проведем ежедневный мониторинг закупок по профилю вашей компании',
            '• Оформим независимые гарантии в банках-партнерах на лучших условиях',
            'Стоимость в месяц: <b>30 000</b> ₽ в месяц или <b>12 000</b> ₽ в мес. + <b>1%</b> от стоимости заключенного контракта (но не более <b>300 000</b> ₽)',
            'При покупке годового пакета: <b>250 000</b> ₽ в год или <b>100 000</b> ₽ в год + <b>0,5%</b> от стоимости заключенного контракта (но не более <b>250 000</b> ₽)'
        ]
    },
    {
        id: 8,
        title: 'Стоимость отдельных услуг',
        description: '',
        items: [
            'Регистрация в ЕИС: <b>5 000</b> ₽',
            'Актуализация сведений в ЕИС: <b>2 000</b> ₽',
            'Регистрация на электронной площадке: <b>5 000</b> ₽',
            'Ежедневный мониторинг закупок: <b>5 000</b> ₽ в месяц',
            'Подготовка заявки по 44-ФЗ: <b>5 000</b> ₽ + <b>1,2%</b> от стоимости заключенного контракта (но не более <b>350 000</b> ₽)',
            'Подготовка заявки по 223-ФЗ: <b>10 000</b> ₽ + <b>1,2%</b> от стоимости заключенного контракта (но не более <b>350 000</b> ₽)',
            'Подготовка, подача жалоб и представление интересов в ФАС: <b>10 000</b> ₽ + <b>1%</b> от НМЦК (но не более <b>150 000</b> ₽)',
            'Консультирование по действующему законодательству в сфере закупок: <b>3 000</b> ₽',
            'Формирование актов в ЕИС: <b>3 000</b> ₽',
            'Правовая экспертиза контракта: <b>7 000</b> ₽',
            'Правовая экспертиза соглашений: <b>2 000</b> ₽',
            'Подготовка претензии или ответа на претензию: <b>25 000</b> ₽',
            'Подготовка судебных документов и представление интересов в суде: <b>50 000</b> ₽ + дополнительные расходы',
            'Предоставление позиции в спорных ситуациях по контракту: <b>10 000</b> ₽',
            'Открытие казначейского счета: <b>10 000</b> ₽',
            'Анализ соисполнителей по контракту: <b>2 000</b> ₽',
            'Правовая оценка договоров на соисполнение по контракту: <b>5 000</b> ₽'
        ]
    },
    // {
    //     id: 9,
    //     title: 'Контакты',
    //     description: 'Данные',
    //     items: []
    // }
];
</script>

<style scoped>
.services-list {
  display: flex;
  flex-direction: column;
  align-items: flex-start; 
}
</style>
